lab11_php_ci/ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->paginate(2), #data dibatasi 2 record perhalaman
---
SELECT *
FROM `artikel`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`